# BuiltInFailures.InfillFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures Class
BuiltInFailures Class Members See Also
---
Failures about Infill.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class InfillFailures
```

Visual Basic
---
```text
Public NotInheritable Class InfillFailures
```

Visual C++
---
```text
public ref class InfillFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..InfillFailures
# See Also
BuiltInFailures..::..InfillFailures Members
Autodesk.Revit.DB Namespace